Repository: bit-part/craftcms_docs-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: This tag helps create a hierarchical navigation menu for entries in a Structure section or a Category Group.
ja: このタグは、ストラクチャー構造やカテゴリグループのエントリの階層的なナビゲーションメニューを作成するのに役立ちます。

source: This tag makes it easy to paginate a set of elements across multiple pages.
ja: このタグは、複数ページにわたるエレメントのセットを簡単にページ割りできます。

source: This tag will cache a portion of your template, which can improve performance for subsequent requests, as they will have less work to do.
ja: このタグはテンプレートの一部をキャッシュするため、後からのリクエストのパフォーマンスを向上させます。

source: This tag will ensure that the current user is logged in with an account that has a given permission.
ja: このタグは、現在のユーザーが特定の権限を持つアカウントでログインしていることを保証します。

source: This tag will ensure that the user is logged in.
ja: このタグは、ユーザーがログインしていることを保証します。

source: This tag will prevent the rest of the template from executing, and end the request.
ja: このタグは残りのテンプレートの実行を防ぎ、リクエストを終了します。

source: This tag will redirect the browser to a different URL.
ja: このタグは、ブラウザを別の URL にリダイレクトします。

source: This tag will set a new HTTP header on the response.
ja: このタグは、レスポンス上に新しい HTTP ヘッダーをセットします。

source: This template code will only cost 3 queries: one to fetch the entries, one to determine which assets should be eager-loaded, and one to fetch the assets.
ja: このレンプレートコードは、たった3クエリしかコストがかかりません。エントリを取り出すための1つ、どのアセットを eager-loaded すべきか決定するための1つ、そして、アセットを取り出すための1つです。

source: Three Types of Twig Tags
ja: 3種類の Twig タグ

source: Tip: If this parameter is omitted, your config setting will be used to define the default duration.
ja: ヒント：このパラメータが省略される場合、コンフィグ設定の がデフォルトの継続時間を定義するために使用されます。

source: Tip: If this parameter is omitted, your cacheDuration config setting will be used to define the default duration.
ja: ヒント：このパラメータが省略される場合、コンフィグ設定の cacheDuration がデフォルトの継続時間を定義するために使用されます。

source: Tip: That’s a reference to shish kebabs for those of you that don’t get the analogy.
ja: ヒント：類推できない方のために、シシカバブの参照です。

source: Tip: The {% cache %} tag will detect if there are any ungenerated image transform URLs within it.
ja: ヒント：{% cache %} タグは、その中にまだ生成されていない 画像の変形 URL が含まれるかどうかを検出します。

source: Tip: The {% nav %} tag should only be used in times when you want to show elements in a hierarchy, and you want the DOM to express that hierarchy.
ja: ヒント：{% nav %} タグは、エレメントを階層的に表示したい、かつ、DOM で階層構造を表現したいときだけ使用するべきです。

source: Tip: This tag is a bit simpler than other languages’ switch implementations you may have seen: matching cases are automatically broken out of, so there’s no need for break statements.
ja: ヒント：このタグはあなたが目にしたことがあるかもしれない他の言語の switch 実装よりも少し単純です。マッチした cases で自動的に終了するため、break ステートメントは必要ありません。

source: Tip: Want to install Craft from the command line?
ja: ヒント：コマンドラインから Craft をインストールしたいですか？

source: Tip: You can combine this parameter with `globally` to cache templates on a per-page basis, without letting any query string variables get included in the path:
ja: ヒント：クエリ文字列の変数をパスに含めることなく、ページごとのテンプレートをキャッシュするために、`globally` パラメータを組み合わせることができます。

source: Tip: You can only use `for`
ja: ヒント：`for`

source: Tip: You can only use `if`
ja: ヒント：`if`

source: Tip: You can use the config setting to customize what comes before the actual page number in your URLs.
ja: ヒント：URL の実際のページ番号の前にあるものをカスタマイズするために、コンフィグ設定の を使用することができます。

source: Tip: You can use the pageTrigger config setting to customize what comes before the actual page number in your URLs.
ja: ヒント：URL の実際のページ番号の前にあるものをカスタマイズするために、コンフィグ設定の pageTrigger を使用することができます。

source: Title Field Label – What the “Title” field label should be.
ja: タイトルフィールドラベル – 「タイトル」フィールドのラベルをどうするか

source: To assign categories to things (entries, assets, users, etc.), you must first create a Categories field.
ja: 項目（エントリ、アセット、ユーザーなど）にカテゴリを割り当てるには、先にカテゴリフィールドを作成しなければなりません。

source: To assign tags to things (like Entries), you must create a Tags field and add it to a Field Layout.
ja: どこか（エントリなど）にタグを割り当てるには、タグフィールドを作成し、フィールドレイアウトで追加しなければなりません。

source: To check if your Assets field has any selected assets, you can use the length filter:
ja: アセットフィールドに選択されたアセットがあるかどうかを調べるには、length フィルタを利用します。

source: To check if your Categories field has any selected tags, you can use the length filter:
ja: カテゴリフィールドに選択されたカテゴリがあるかどうかを調べるには、length フィルタを利用します。

source: To check if your Entries field has any selected entries, you can use the length filter:
ja: エントリフィールドに選択されたエントリがあるかどうかを調べるには、length フィルタを利用します。

source: To check if your Tags field has any selected tags, you can use the length filter:
ja: タグフィールドに選択されたタグがあるかどうかを調べるには、length フィルタを利用します。

source: To check if your Users field has any selected users, you can use the length filter:
ja: ユーザーフィールドに選択されたユーザーがあるかどうかを調べるには、length フィルタを利用します。

source: To create a Global Set, go to Settings → Globals.
ja: グローバル設定を作るには、「設定 > グローバル」に移動します。

source: To create a new Craft project, run this command (substituting with the path where Composer should create the project):
ja: 新しい Craft プロジェクトを作成するため、次のコマンドを実行してください。（Composer が作成するプロジェクトのパスの代わりに と記載しています。）

source: To create a new Route, go to Settings → Routes and click the New Route button.
ja: 新しいルートを作成するには、「設定 > ルート」に移動し、「新規ルート」ボタンをクリックします。

source: To create a new User Group, go to Settings → Users and click the “New Group” button.
ja: 新しいユーザーグループを作るには、「設定 > ユーザー」に移動し、「新しいユーザーグループ」ボタンをクリックします。

source: To create a new category group, go to Settings → Categories and click the “New Category Group” button.
ja: 新しいカテゴリグループを作るには、「設定 > カテゴリ」に移動し、「新しいカテゴリーグループ」ボタンをクリックします。

source: To create a new migration, open up your terminal and go to your Craft project:
ja: 新しいマイグレーションを作成するために、ターミナルを開き Craft プロジェクトに移動してください。

source: To create a new section, go to Settings → Sections and click the “New Section” button.
ja: 新しいセクションを作るには、「設定 > セクション」に移動し、「新規セクション」ボタンをクリックします。

source: To create a new tag group, go to Settings → Tags and click New Tag Group.
ja: 新しいタググループを作るには、「設定 > タグ」に移動し、「新しいタググループ」ボタンをクリックします。

source: To create a plugin, create a new directory for it somewhere on your computer.
ja: プラグインを作るため、コンピュータのどこかに新しいディレクトリを作成してください。

source: To create a search form, first create a normal HTML form with a search input:
ja: 検索フォームを作成するには、初めに入力項目 search を含む通常の HTML を作成します。

source: To do this, you will need to have an output for displaying a single entry you want to allow comments on.
ja: これを行うためには、コメントを許可する単一のエントリを表示するための出力設定が必要です。

source: To enable public registration, go to Settings → Users → Settings, and check the “Allow public registration?” setting.
ja: 一般登録を有効にするには、「設定 > ユーザー > 設定」に移動し、「一般登録を許可しますか？」をチェックします。

source: To execute migrations from the Migrations utility, go to Utilities → Migrations in the Control Panel and click the “Apply new migrations” button.
ja: マイグレーションユーティリティから実行するには、コントロールパネールで「ユーティリティ > マイグレーション」に移動し、「新しいマイグレーションを適用」ボタンをクリックします。

source: To execute migrations from the terminal, go to your Craft project and run this command:
ja: ターミナルからマイグレーションを実行するには、Craft プロジェクトに移動して次のコマンドを実行します。

source: To get Craft to see your plugin, you will need to install it as a Composer dependency of your Craft project.
ja: Craft にプラグインを表示するには、Craft プロジェクトの Composer 依存としてインストールする必要があります。

source: To get the first (and only) asset selected, use one():
ja: 選択された最初の（1つだけの）アセットを取得するには、one() を利用します。

source: To get the first (and only) entry selected, use one():
ja: 選択された最初の（1つだけの）エントリを取得するには、one() を利用します。

source: To get the first (and only) tag selected, use first():
ja: 選択された最初の（1つだけの）タグを取得するには、first() を利用します。

source: To get the first (and only) tag selected, use one():
ja: 選択された最初の（1つだけの）カテゴリを取得するには、one() を利用します。

source: To get the first (and only) user selected, use one():
ja: 選択された最初の（1つだけの）ユーザーを取得するには、one() を利用します。

source: To learn more, visit the Continued Reading section at the bottom of this page or refer directly to the official Twig documentation .
ja: より詳しいことは、このページの下段にある「続きを読む」セクションを見るか、Twig 公式ドキュメントを直接参照してください。

source: To loop through the selected assets, you can treat the field like an array:
ja: 選択されたアセットをループするには、フィールドを配列のように扱います。

source: To loop through the selected categories:
ja: 選択されたカテゴリをループするには

source: To loop through the selected entries:
ja: 選択されたエントリをループするには

source: To loop through the selected tags, you can treat the field like an array:
ja: 選択されたタグをループするには、フィールドを配列のように扱います。

source: To loop through the selected users:
ja: 選択されたユーザーをループするには

source: To output an image with a transform applied, simply pass your transform’s handle into your asset’s getUrl(), getWidth(), and getHeight() functions:
ja: トランスフォームを適用した画像を出力するには、トランスフォームのハンドルをアセットの getUrl()、getWidth()、および getHeight() ファンクションに渡します。

source: To output your Matrix blocks in a template, use a for-loop pointed at your Matrix field:
ja: テンプレート内で行列フィールドを出力するには、行列フィールドに対して for ループ を使用します。

source: To override the mailer component config (which is responsible for sending emails), do this in config/app.php:
ja: （メール送信を担っている）mailer コンポーネントの設定を上書きするために、config/app.php を調整します。

source: To review the specifics of each type, check out the Sections and Entries page of this documentation.
ja: 各タイプの詳細を確認するには、このドキュメントのセクションとエントリページをチェックしてください。

source: To set it up, open your Craft project’s composer.json file and make the following changes:
ja: 設定するには、Craft プロジェクトの composer.json ファイルを開き、次の変更を加えます。

source: To set the Translation Method, go into each field you'd like to translate and choose the appropriate option under Translation Method.
ja: 翻訳方法をセットするには、翻訳したいそれぞれのフィールドに移動し、翻訳方法で適切なオプションを選択します。

source: To set this up, we create a new field of the Entries Field Type, give it the name Ingredients, check Ingredients as the source (the available elements will be from the Ingredients section), and leave the Limit field blank so we can choose as many ingredients as each recipe dictates.
ja: これを設定するために、エントリフィールドタイプの新しいフィールドを作成し、「原材料」という名前を付け、ソース（利用可能なエレメントが原材料セクションに存在するとします）から「原材料」を選択し、それぞれのレシピが必要とする多くの原材料を選択できるようリミット欄を空白のままにします。

source: To set your site up with the same directory structure (including the PHP dotenv-based configuration) as a brand new Craft 3 project, follow these instructions:
ja: 新しい Craft 3 プロジェクト（PHP dotenv をベースとした設定を含む）と同様のディレクトリ構成でサイトをセットアップする場合、次のガイドに従ってください。

source: To show the children of the current element in the loop, use the {% children %} tag.
ja: ループ内の現在のエレメントの子を表示するには、{% children %} タグを使用します。

source: To that end, we have a few ground rules that we ask people to adhere to.
ja: そこで、わたしたちにはみなさんにしっかり守ってもらいたい幾つかの基本ルールがあります。

source: To toggle between sites while viewing Global Sets, use the drop-down menu at the top left of the Global Sets page in the Control Panel.
ja: グローバル設定を表示中にサイトを切り替えるには、コントロールパネルのグローバル設定ページの左上にあるドロップダウンメニューを使用します。

source: To update Craft without making any major changes to your site’s directory structure, follow these instructions.
ja: サイトのディレクトリ構成を大幅に変更することなく Craft をアップデートするには、次の手順に従ってください。

source: To use Redis cache storage, you will first need to install the yii2-redis library.
ja: Redis キャッシュストレージを利用するには、あらかじめ yii2-redis ライブラリをインストールする必要があります。

source: Toggling between sites in Globals
ja: グローバル内のサイトの切り替え

source: Top-Center
ja: 上中

source: Top-Left
ja: 上左

source: Top-Right
ja: 上右

source: Transforms are non-destructive, meaning that they have no effect on the original image that was uploaded.
ja: トランスフォームは 非破壊的 で、アップロードされた元画像には影響しません。

source: Translatable Fields
ja: 翻訳可能なフィールド

source: Translates a message with Craft::t().
ja: Craft::t() でメッセージを翻訳します。

source: Treating Queries as Arrays
ja: クエリを配列として扱う

source: Troubleshooting
ja: トラブルシューティング

source: Try going to http://example.com/index.php/admin or http://example.com/index.php?p=admin instead.
ja: 代わりに http://example.com/index.php/admin または http://example.com/index.php?p=admin にアクセスしてみてください。

source: Twig 1 let you call block() even for blocks that didn’t exist:
ja: Twig 1 では、存在しないブロックでさえも block() で呼び出すことができます。

source: Twig 2 requires that you explicitly import macros in each template where you are using them.
ja: Twig 2 では、利用先となる各テンプレートで明示的にマクロをインポートする必要があります。

source: Twig 2 will throw an error unless it’s a defined test:
ja: Twig 2 では、defined のテストでない限り、エラーを返します。

source: Twig Primer
ja: Twig 入門書

source: Twig Templates in Craft is a video course by Mijingo that aims to get you comfortable with using Twig in Craft.
ja: Twig Templates in Craft は、Craft の Twig を快適に使えるようになることを目的とした、Mijingo によるビデオコースです。

source: Twig and Craft provide several functions that you can use within your template tags:
ja: Twig と Craft は、テンプレートタグ内で利用できるいくつかのファンクションを提供します。

source: Twig for Designers is an in-progress eBook that aims to explain how Twig works to non-developers.
ja: Twig for Designers は進行中の eBook で、非開発者が Twig をどのように使えるか説明することを目的としています。

source: Twig for Template Designers documents all of Twig’s features in detail.
ja: Twig for Template Designers は、すべての Twig の機能を詳細なドキュメントです。

source: Twig is elegant, powerful, and blazing fast.
ja: Twig は、エレガントで、パワフルで、 かつ、とても高速です。

source: Twig is fantastic because it is flexible and fast.
ja: 柔軟で高速なため、Twig は素晴らしいです。

source: Twig isn’t specific to Craft; it’s developed and maintained by the Symfony project.
ja: Twig は Craft 特有のものではなく、Symfony プロジェクトによって開発され、メンテナンスされています。

source: Twig won't evaluate anything inside the comment tags; it will simply pretend they don’t exist.
ja: Twig はコメントタグの内容を何も評価しません。単にそれが存在しないものとして振る舞います。

source: Twig-facing copy of the SORT_ASC PHP constant.
ja: PHP 定数 SORT_ASC の Twig 対応のコピー。

source: Twig-facing copy of the SORT_DESC PHP constant.
ja: PHP 定数 SORT_DESC の Twig 対応のコピー。

source: Twig-facing copy of the SORT_FLAG_CASE PHP constant.
ja: PHP 定数 SORT_FLAG_CASE の Twig 対応のコピー。

source: Twig-facing copy of the SORT_LOCALE_STRING PHP constant.
ja: PHP 定数 SORT_LOCALE_STRING の Twig 対応のコピー。

source: Twig-facing copy of the SORT_NATURAL PHP constant.
ja: PHP 定数 SORT_NATURAL の Twig 対応のコピー。

source: Twig-facing copy of the SORT_NUMERIC PHP constant.
ja: PHP 定数 SORT_NUMERIC の Twig 対応のコピー。

source: Twig-facing copy of the SORT_REGULAR PHP constant.
ja: PHP 定数 SORT_REGULAR の Twig 対応のコピー。

source: Twig-facing copy of the SORT_STRING PHP constant.
ja: PHP 定数 SORT_STRING の Twig 対応のコピー。

source: Twig-facing copy of the craft\web\View::POS_BEGIN constant.
ja: 定数 craft\web\View::POS_BEGIN の Twig 対応のコピー。

source: Twig-facing copy of the craft\web\View::POS_END constant.
ja: 定数 craft\web\View::POS_END の Twig 対応のコピー。

source: Twig-facing copy of the craft\web\View::POS_HEAD constant.
ja: 定数 craft\web\View::POS_HEAD の Twig 対応のコピー。

source: Twig-facing copy of the craft\web\View::POS_LOAD constant.
ja: 定数 craft\web\View::POS_LOAD の Twig 対応のコピー。

source: Twig-facing copy of the craft\web\View::POS_READY constant.
ja: 定数 craft\web\View::POS_READY の Twig 対応のコピー。

source: Type – The type of content allowed in the column.
ja: タイプ – 列に許可されるコンテンツのタイプ

source: Typically each entry will have a stake in its own primary URL on your site, though Craft can fetch any entry from anywhere if your template needs it.
ja: 一般的に、それぞれのエントリはサイトの独自のプライマリー URL に関わり合いを持ちますが、Craft ではテンプレートが必要とするならば、どこからでもエントリを取得できます。

source: URL Fields
ja: URL フィールド

source: URL Rules
ja: URL ルール

source: Undefined Blocks
ja: 未定義のブロック

source: Under Translation Method, choose "Translate for each language."
ja: 翻訳方法で「各言語に対して翻訳する」を選択します。

source: Unlike the other section types, Singles only have one entry associated with them, and they don’t have an editable Author, Slug, Post Date, or Expiration Date.
ja: 他のセクションタイプと異なり、シングルは1つのエントリしか関連付けられておらず、編集可能な投稿者、スラグ、投稿日、または有効期限日がありません。

source: Unnamed parameters are no longer allowed (e.g. ([^\/]+)).
ja: 名前付けされていないパラメータ（例：([^\/]+)）は、もはや許可されません。

source: Unwelcome sexual attention.
ja: ありがたくない性の対象としての注目。

source: Update the File System Path setting to point to the new folder location
ja: 「ファイルシステムのパス」設定を新しいフォルダのロケーションにしてアップデートします。

source: Update your DNS records so the domain points at the web server.
ja: ドメインがウェブサーバーを指すよう、DNS レコードをアップデートします。

source: Update your web server to point to your new project’s web/ directory.
ja: 新しいプロジェクトの web/ ディレクトリを参照するよう、ウェブサーバーの設定をアップデートします。

source: Updating
ja: アップデート

source: Updating Craft 3
ja: Craft 3 のアップデート

source: Updating Plugins for Craft 3
ja: Craft 3 向けのプラグインアップデート

source: Updating Your Asset Indexes
ja: アセットインデックスのアップデート

source: Upgrading & Updating Craft
ja: Craft のアップグレード、および、アップデート

source: Upgrading Craft
ja: Craft のアップグレード

source: Upgrading from Craft 2
ja: Craft 2 からのアップグレード

source: Upload new files
ja: 新しいファイルのアップロード

source: Uploading Files from Front-end Entry Forms
ja: フロントエンドフォームからのファイルアップロード

source: Use $foo === null/$bar !== null rather than is_null($foo)/!is_null($bar).
ja: is_null($foo) / !is_null($bar) よりむしろ $foo === null / $bar !== null を使用してください。

source: Use (int)$foo/(float)$bar rather than intval($foo)/floatval($bar).
ja: intval($foo) / floatval($bar) よりむしろ (int)$foo / (float)$bar を使用してください。

source: Use craft.app.language to toggle specific parts of your templates, depending on the language:
ja: craft.app.language を利用して、言語に依存するテンプレートの特定パーツを切り替えます。

source: Use element if you don’t care whether the returned elements are the source or the target of a relation with the element(s) you’re passing in
ja: 返されるエレメントが、渡したエレメントとソースまたはターゲットのどちらで関連付くかを気にしない場合、elementを使用します

source: Use sourceElement if you want to find elements related to the given element, where the given element is the source of the relation
ja: 与えられたエレメントのソースとして関連付くエレメントだけを見つけたい場合、sourceElement を使用します

source: Use targetElement if you want to find elements related to the given element, where the given element is the target of the relation
ja: 与えられたエレメントのターゲットとして関連付くエレメントだけを見つけたい場合、targetElement を使用します

source: Use strict comparison operators (=== and !==) whenever possible.
ja: 可能な限り、厳格な比較演算子（=== および !==）を使用してください。

source: Use the siteUrl config setting instead
ja: 代わりに、コンフィグ設定の siteUrl を使ってください

source: Use the limit parameter to define how many elements should show up per page.
ja: limit パラメータを使用して、ページごとに表示するエレメント数を定義します。

source: Use the short array syntax (['foo' => 'bar']).
ja: 短い配列構文（['foo' => 'bar']）を使用してください。

source: Use this template as a starting point for your Plugin.php file:
ja: このテンプレートを Plugin.php ファイルの出発点として使用してください。

source: Use this template as a starting point for your composer.json file:
ja: composer.json ファイルの出発点として、このテンプレートを使用してください。

source: User Groups
ja: ユーザーグループ

source: User Photos
ja: ユーザーフォト

source: User Profile Form
ja: ユーザープロフィールの編集フォーム

source: User Query Params
ja: ユーザーのクエリパラメータ

source: User Registration Form
ja: ユーザー登録フォーム

source: User photos are stored as assets now.
ja: ユーザーフォトはアセットとして保存されるようになりました。

source: User
ja: ユーザー

source: Users
ja: ユーザー

source: Users Fields
ja: ユーザーフィールド

source: Users fields have the following settings:
ja: ユーザーフィールドの設定は、次の通りです。

source: Users fields list all of the currently selected users, with a button to select new ones:
ja: ユーザーフィールドには、現在選択されているすべてのユーザーのリストと、新しいユーザーを追加するためのボタンがあります。

source: Users fields type allow you relate users to the parent element.
ja: ユーザーフィールドでは、ユーザーを親エントリに関連付けることができます。

source: Users all share a single field layout defined in Settings → Users → Fields.
ja: ユーザーは、「設定 > ユーザー > フィールド」で定義された単一のフィールドレイアウトを共有します。

source: Using new or existing entries, test that the Section, Field, and Translation Method settings work as you expect.
ja: 新規または既存のエントリを利用し、セクション、フィールド、および翻訳方法の設定が期待通りに機能しているかテストします。

source: Using the withTransforms param has no effect on how you’d access image transforms further down in the template.
ja: withTransforms パラメータを使っても、テンプレート内の変換された画像にアクセスする方法には影響を与えません。

source: Utilities
ja: ユーティリティ

source: Utility Types
ja: ユーティリティタイプ

source: Variables
ja: 変数

source: Variables in Twig are just like variables in Javascript or any other programming language.
ja: Twig の変数は、JavaScript や他のプログラミング言語の変数に似ています。

source: View [Asset Source Name]
ja: 「アセットソース名」を表示する

source: View [Asset Volume Name]
ja: 「アセットソース名」 を表示する

source: View past versions of the entry
ja: エントリの過去のバージョンの閲覧

source: View past versions of the entry (Craft Client or Craft Pro required)
ja: エントリの過去のバージョンの閲覧（Craft Client または Craft Pro が必要）

source: Violations of this code outside of any spaces managed by the Craft team will still affect a person’s ability to participate within them.
ja: Craft チームが管理していない場所でこの行動規範に違反した場合、コミュニティに参加する資格があるかどうかの判断基準に悪影響を及ぼすでしょう。

source: Violent threats or language directed against another person.
ja: 他の人に対する暴力的な脅迫、または、言葉による命令。

source: Volume Types
ja: ボリュームタイプ

source: Volumes – Which asset volumes the field should be able to select/upload files from
ja: ソース – ファイルの選択・アップロードを可能とするアセットボリューム

source: Volumes’ Base URL settings
ja: ボリュームのベース URL 設定

source: Warning: If you change the template code within a {% cache %} that uses a custom key, any existing template caches will not automatically be purged.
ja: 警告：カスタムキーを利用している {% cache %} 内のテンプレートコードを変更する場合、既存のテンプレートキャッシュは自動的にパージされません。

source: Warning: If you’re suffering from abnormal page load times, you may be experiencing a suboptimal hosting environment.
ja: 警告：異常なページの読み込み時間で苦しむ場合、最適なホスティング環境を経験していないかもしれません。

source: Warning: Only a single {% paginate %} tag should be used per request.
ja: 警告：リクエストごとに、1つの {% paginate %} タグだけを使用しなければなりません。

source: Warning: The {% nav %} tag requires elements to be queried in a specific (hierarchical) order, so make sure you don’t override the order criteria parameter in conjunction with this tag.
ja: 警告：{% nav %} タグは特定の（階層的な）順序でエレメントを照会する必要があります。そのため、このタグと関連して order 基準パラメータを上書きしないよう確認してください。

source: Warning: This parameter needs to be an actual ElementCriteriaModel object; not an array of elements.
ja: 警告：このパラメータは、実際の ElementCriteriaModel オブジェクトである必要があります。エレメントの配列ではありません。

source: We can determine the current block type’s handle by checking `block.type`.
ja: `block.type` をチェックすることによって、現在のブロックタイプのハンドルを確認できます。

source: We can determine the current block type’s handle by checking block.type ().
ja: block.type （）をチェックすることによって、現在のブロックタイプのハンドルを確認できます。

source: We change its file name to _entry.html so it is considered hidden by Craft and update the settings in our Section.
ja: そこで、Craft が不可視ファイルだとみなすようファイル名を _entry.html に変更し、セクションの設定をアップデートします。

source: We could get even more detailed with the Recipe Content but this will be fine for now.
ja: レシピのコンテンツをより詳細にするかもしれませんが、今のところは十分でしょう。

source: We created this documentation to accurately record the functionality of Craft with the purpose of helping you understand how to use it to build websites.
ja: ウェブサイトの構築にあたり、どのように Craft を使うべきか理解するのを助ける目的で、わたしたちは Craft の機能性を正確に記録したこのドキュメントを作成しました。

source: We made Craft for bespoke websites and mobile applications, where strong control over branding and content types are a priority.
ja: わたしたちは、ブランディングやコンテンツタイプを強力にコントロールすることを優先するオーダーメードのウェブサイトやモバイルアプリケーションのために Craft を作りました。

source: We might all experience some frustration now and then, but we cannot allow that frustration to turn into a personal attack.
ja: わたしたちは時折いくらかのフラストレーションを経験するかもしれません。しかし、それが個人攻撃に変わることを許容しません。

source: We optimized it for creating experiences from scratch, rather than modifying existing themes.
ja: 既存のテーマを修正するよりもむしろ、ゼロから創造することに最適化されています。

source: We recommend you have template directories named after the sites handles (e.g. templates/default and templates/beta).
ja: サイトハンドルを名前に付けたテンプレートディレクトリ（例： templates/default と templates/beta）を持たせることをオススメします。

source: We take all reports seriously, and your identity will remain confidential.
ja: わたしたちはすべての報告を真剣に受け止め、かつ、あなたの身元は機密のままであるようにします。

source: We use Fields in Craft to define the different content types that are stored in an Entry.
ja: Craft のフィールドを利用して、エントリに格納する様々なコンテンツタイプを定義します。

source: We use Templates in Craft to output our website design and content.
ja: ウェブサイトのデザインやコンテンツを出力するために、Craft のテンプレートを利用します。

source: We've already created the Section called "Recipes" to hold our entries.
ja: エントリを保持するため「レシピ」と呼ばれるセクションをすでに作成してあります。

source: Web Browser Setup
ja: ウェブブラウザによるセットアップ

source: What are Plugins?
ja: プラグインとは？
